In [1]:
import pandas as pd

Example

In [9]:
d={"name":["a","b","c","d","a","c"],"eng":[2,2,3,4,2,6],"hindi":[1,4,3,2,1,6]}

In [30]:
df=pd.DataFrame(d)
df

  name  eng  hindi
0    a    2      1
1    b    2      4
2    c    3      3
3    d    4      2
4    a    2      1
5    c    6      6

In [ ]:
df["Duplicated"]=df.duplicated()
df

In [31]:
df.drop_duplicates(inplace=True)
df

  name  eng  hindi
0    a    2      1
1    b    2      4
2    c    3      3
3    d    4      2
5    c    6      6

Dataset Work

In [32]:
dataset=pd.read_csv(r"E:\tops\Data science\practical\loan.csv")
dataset.head(3)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y

In [34]:
dataset.duplicated().sum()

np.int64(0)